In [61]:
import numpy as np
import pandas as pd
import sqlite3

In [62]:
pd.set_option('display.max_columns', None)

In [63]:
path_airlines = "./aerolineas/"
database_airlines = path_airlines + 'travel.sqlite'

In [64]:
path_airlines = "./aerolineas/travel.sqlite/"
database_airlines = path_airlines + 'travel.sqlite'

### 1.	¿Cuántas tablas tiene la base de datos? (uso de consultas select)

In [65]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT COUNT(*) AS cantidad_de_tablas
                        FROM sqlite_master
                        WHERE type='table';""", conn)
tables

   cantidad_de_tablas
0                   8

### 2.	¿Qué información hay en cada tabla? (uso de select en una tabla)

In [66]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT * FROM sqlite_master WHERE type = "table";""", conn)
tables

,type,name,tbl_name,rootpage,sql
0,table,aircrafts_data,aircrafts_data,2,CREATE TABLE aircrafts_data (\r\n aircraft_...
1,table,airports_data,airports_data,3,CREATE TABLE airports_data (\r\n airport_co...
2,table,boarding_passes,boarding_passes,4,CREATE TABLE boarding_passes (\r\n ticket_n...
3,table,bookings,bookings,5,CREATE TABLE bookings (\r\n book_ref charac...
4,table,flights,flights,6,CREATE TABLE flights (\r\n flight_id intege...
5,table,seats,seats,7,CREATE TABLE seats (\r\n aircraft_code char...
6,table,ticket_flights,ticket_flights,8,CREATE TABLE ticket_flights (\r\n ticket_no...
7,table,tickets,tickets,9,CREATE TABLE tickets (\r\n ticket_no charac...

## ii. Para el dataset de aviones responder: 

### 1.	¿En el dataset de aviones: que tipos de asientos y tiquetes hay?

In [68]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT DISTINCT fare_conditions AS tipo_de_asiento
                        FROM seats;""", conn)
tables

  tipo_de_asiento
0        Business
1         Economy
2         Comfort

In [69]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT DISTINCT fare_conditions AS tipo_de_tiquete
                        FROM ticket_flights;""", conn)
tables

  tipo_de_tiquete
0        Business
1         Comfort
2         Economy

### 2.	¿Qué modelos de aviones hay?

In [70]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT DISTINCT model AS modelo_de_avion
                        FROM aircrafts_data;""", conn)
tables

                                     modelo_de_avion
0    {"en": "Boeing 777-300", "ru": "Боинг 777-300"}
1    {"en": "Boeing 767-300", "ru": "Боинг 767-300"}
2  {"en": "Sukhoi Superjet-100", "ru": "Сухой Суп...
3  {"en": "Airbus A320-200", "ru": "Аэробус A320-...
4  {"en": "Airbus A321-200", "ru": "Аэробус A321-...
5  {"en": "Airbus A319-100", "ru": "Аэробус A319-...
6    {"en": "Boeing 737-300", "ru": "Боинг 737-300"}
7  {"en": "Cessna 208 Caravan", "ru": "Сессна 208...
8  {"en": "Bombardier CRJ-200", "ru": "Бомбардье ...

### 3.	¿Cuántas reservas hay?

In [71]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT COUNT(*) AS total_de_reservas
                        FROM bookings;""", conn)
tables

   total_de_reservas
0             262788

### 4.	¿Cuál es el precio medio de las reservas? ¿el más caro? ¿El más barato?

In [72]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT AVG(total_amount) AS precio_medio_de_reservas
                        FROM bookings;""", conn)
tables

   precio_medio_de_reservas
0              79025.605812

In [73]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT MAX(total_amount) AS precio_mas_caro
                        FROM bookings;""", conn)
tables

   precio_mas_caro
0          1204500

In [74]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT MIN(total_amount) AS precio_mas_barato
                        FROM bookings;""", conn)
tables

   precio_mas_barato
0               3400

### 5.	¿Qué rangos de aeronaves hay? (ordenarlos descendentemente)

In [75]:
conn =sqlite3.connect(r"C:\Program Files\DataSets\aerolineas\travel.sqlite")

tables = pd.read_sql("""SELECT DISTINCT range AS rango_de_aeronave
                        FROM aircrafts_data
                        ORDER BY range DESC;""", conn)
tables

   rango_de_aeronave
0              11100
1               7900
2               6700
3               5700
4               5600
5               4200
6               3000
7               2700
8               1200